void main() {

}

/* Task #8.
Некая сеть фастфудов предлагает несколько видов гамбургеров: маленький (50 сом, 
20 калорий) 
большой (100 сом, 40 калорий) 
Гамбургер может быть с одним из нескольких видов начинок (обязательно): 
сыром (+ 10 сом, + 20 калорий) 
салатом (+ 20 сом, + 5 калорий) 
картофелем (+ 15 сом, + 10 калорий) 
Дополнительно, гамбургер можно посыпать приправой (+ 15 сом, 0 калорий) и полить 
майонезом (+ 20 сом, + 5 калорий). 
Напиши программу, расчиытвающую стоимость и калорийность гамбургера. 
Используй ООП подход (подсказка: нужен класс Гамбургер, методы для выбора опций 
и рассчета нужных величин). 
Код должен быть защищен от ошибок. 
Представь, что твоим классом будет пользоваться другой программист. Е
сли он передает неправильный тип гамбургера, например, или неправильный вид 
добавки, должно выбрасываться исключение (ошибка не должна молча игнорироваться).
*/

